
Процедура ПередЗаписью(Отказ)
	
	Если НЕ СтрЗаканчиваетсяНа(РабочийКаталог, "\") Тогда
		РабочийКаталог = РабочийКаталог + "\";
	КонецЕсли; 
			
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОписаниеХранилищ.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ОписаниеХранилищ КАК ОписаниеХранилищ
	               |ГДЕ
	               |	НЕ ОписаниеХранилищ.Ссылка = &Ссылка
	               |	И ОписаниеХранилищ.РабочийКаталог ПОДОБНО &РабочийКаталог";     
	
	Запрос.УстановитьПараметр("РабочийКаталог", РабочийКаталог);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Отказ = Истина;
		Сообщить("рабочий каталог совпадает с каталогом " + Строка(Ссылка));
	КонецЦикла;  
	
	Если НЕ Отказ Тогда
		СоздатьКаталог(РабочийКаталог);
	КонецЕсли;
	
КонецПроцедуры
