Функция ПолучитьПользователя(Владелец, Пользователь) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ПользователиХранилища.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ПользователиХранилища КАК ПользователиХранилища
	               |ГДЕ
	               |	ПользователиХранилища.Владелец = &Владелец
	               |	И ПользователиХранилища.Код = &Пользователь"; 
	
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат = Неопределено;
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции