
Процедура ПередЗаписью(Отказ)
	Если НЕ ЗначениеЗаполнено(Код) Тогда
		Сообщить("Не указан код");
		Возврат;
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Спр.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ПользователиХранилища КАК Спр
	               |ГДЕ
	               |	НЕ Спр.Ссылка = &Ссылка
	               |	И Спр.Владелец = &Владелец
				   |	И Спр.ЭлектронныйАдрес = &ЭлектронныйАдрес";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);	
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("ЭлектронныйАдрес", ЭлектронныйАдрес);	
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		//Отказ = Истина;
		Сообщить("Указанный почтовый адрес уже установлен для " + Строка(Выборка.Ссылка));
	КонецЕсли;
КонецПроцедуры
